TwoPhaseFlow-master/run/coffeePot/0.orig/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    Sym
    {
        type fixedFluxPressure;
    }

    bottom
    {
        type fixedFluxPressure;
    }

    outside
    {
        type fixedFluxPressure;
    }

    solid_to_fluid
    {
        type fixedFluxPressure;
    }

    bottomEmptyFaces
    {
        type empty;
    }

    topEmptyFaces
    {
        type empty;
    }
}

// ************************************************************************* //
