TwoPhaseFlow-master/run/coffeePot/constant/fluid/thermophysicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.0;
    }
    equationOfState
    {
        //R           1024;
        rho0        958.4;
        T0          373;
        beta        6.9e-4;
    }
    thermodynamics
    {
        Cp          4216.0;
        Hf          0;
    }
    transport
    {
        mu          0.00028176;
        Pr          1.7703430104321904;
        //Pr          0.17703430104321904; 
    }
}


// ************************************************************************* //
